//--------------------------------------------------------------
// File     : stm32_ub_usb_cdc.h
//--------------------------------------------------------------

//--------------------------------------------------------------
#ifndef __STM32F4_UB_USB_CDC_H
#define __STM32F4_UB_USB_CDC_H


//--------------------------------------------------------------
// Includes
//--------------------------------------------------------------
#include "stm32f4xx.h"
#include "usbd_cdc_vcp.h"


//--------------------------------------------------------------
// Статус соединения USB
//--------------------------------------------------------------
typedef enum {
  USB_CDC_NO_INIT =0, // интерфейс USB не инициализирован 
  USB_CDC_DETACHED,   // USB-соединение инициализировано
  USB_CDC_CONNECTED   // USB-Соединение установлено
}USB_CDC_STATUS_t;
USB_CDC_STATUS_t USB_CDC_STATUS;

//--------------------------------------------------------------
// Окончание ID при отправке
//--------------------------------------------------------------
typedef enum {
  NONE = 0,  // без идентификатора
  LFCR,      // возврат строки и перевод каретки (0x0A,0x0D)
  CRLF,      // перевод каретки и возврат строки (0x0D,0x0A)
  LF,        // перевод строки (0x0A)
  CR         // возврат каретки (0x0D)
}USB_CDC_LASTBYTE_t;

//--------------------------------------------------------------
// Статус при получении
//--------------------------------------------------------------
typedef enum {
  RX_USB_ERR =0, // нет подключения к USB
  RX_EMPTY,      // данные не приходят
  RX_READY       // данные, принятые в буфер
}USB_CDC_RXSTATUS_t;


//--------------------------------------------------------------
// Глобальная функция
//--------------------------------------------------------------
void UB_USB_CDC_Init(void);
USB_CDC_STATUS_t UB_USB_CDC_GetStatus(void);
ErrorStatus UB_USB_CDC_SendString(char *ptr, USB_CDC_LASTBYTE_t end_cmd);
USB_CDC_RXSTATUS_t UB_USB_CDC_ReceiveString(char *ptr);

USB_CDC_RXSTATUS_t UB_USB_CDC_ReceiveString_NEW(char *ptr);

//--------------------------------------------------------------
#endif // __STM32F4_UB_USB_CDC_H
